// 보그PJ 로그인 페이지 JS - login.js

$(()=>{
    /**************************************************************************
        로그인 페이지 유효성 검사
    **************************************************************************/  
   // 대상 : #mid, #mpw
   const mid = $("#mid");
   const mpw = $("#mpw");

   // 유효성 검사 기준 : 전송시 아이디, 비번 모두 빈값 없어야함

   // 공백데이터 처리
   const groSpace = val => val.replace(/\s/g, "");

   // 이벤트 대상 : #sbtn
   // 이벤트 종류 : click
   $("#sbtn").click(function(){
        // 기본기능막기(서브밋 기능차단)
        event.preventDefault();

        // 유효성 검사
        // 아이디, 비밀번호 중 하나라도 비어 있으면 불통과
        if(groSpace(mid.val())===""||groSpace(mpw.val())==="") {
            alert("아이디와 비밀번호 모두 입력해주세요.")
            // 초기화 + 아이디에 포커스
            mid.val("").focus();
            mpw.val("");
        }
        else{
            // 원래는 DB에서 조회된 결과를 받고 성공 메세지를 보이거나 첫페이지로 이동
            alert("로그인에 성공했습니다.")
        }
   }); ///// click

}) ////////////// jQB
